{
    "clubs": [
        {
            "description": "Vice President of the UW campus UX Club.", 
            "id": "uwux", 
            "name": "UW/UX", 
            "term": "Fall 2014 - Spring 2016"
        }, 
        {
            "description": "Soloist and lead baritone for the international finalist A Cappella group.", 
            "id": "waterboys", 
            "name": "The Water Boys", 
            "term": "Fall 2013 - Winter 2017"
        }
    ], 
    "courseDescriptions": false, 
    "education": [
        {
            "degree": "BASc.", 
            "id": "uwaterloo", 
            "minor": "Cognitive Science", 
            "program": "Systems Design Engineering", 
            "school": "University of Waterloo", 
            "url": "uwaterloo.ca/systems-design-engineering/about-systems-design-engineering"
        }
    ], 
    "experience": [
        {
            "company": "Zynga", 
            "location": "Toronto, ON", 
            "position": "Product Manager (Poker)", 
            "responsibilities": [
                "Designed initial UX wireframes and design specifications for a new feature expected to increase Daily Active Users up to 10%.", 
                "Performed background research, user analysis, and A/B testing as part of the design process for a new subscription model.", 
                "Configured final tuning parameters and UX flow for a viral engagement feature which increased Facebook-feed app entry by 36%.", 
                "Managed, analyzed, and reported on key metrics for various in-app experiments"
            ], 
            "term": "Spring 2016", 
            "url": "zynga.com/poker"
        }, 
        {
            "company": "Noom", 
            "location": "New York City, NY", 
            "position": "Product Designer", 
            "responsibilities": [
                "Redesigned the meal-logging experience by leveraging user testing data, in order to better reflect the observed mental model of logging food, which improved clarity and speed of navigation.", 
                "Enhanced the food portion picker interface to improve user confidence when logging food items.", 
                "Prototyped and iterated on interaction designs using Sketch, Framer, and Origami, and tested using Usability Hub and UserTesting.com", 
                "Managed the early design process for the coach dashboard, inviting collaboration with all stakeholders to better understand product requirements."
            ], 
            "term": "Fall 2015", 
            "url": "noom.com"
        }, 
        {
            "company": "KnowRoaming", 
            "location": "Toronto, ON", 
            "position": "UX Designer", 
            "responsibilities": [
                "Redesigned both iOS and Android apps from the ground up. Everything from the registration flow, to the in-app experience for all use cases.", 
                "Designed and developed the KnowRoaming Athletes sign-up page using HTML5, CSS3, CoffeeScript and PHP.", 
                "Lead weekly design meetings with all stakeholders to discuss design of the mobile apps and websites."
            ], 
            "term": "Spring 2014 & Winter 2015", 
            "url": "knowroaming.com"
        }, 
        {
            "company": "Sony", 
            "location": "Waterloo, ON", 
            "position": "UX Designer", 
            "responsibilities": [
                "Lead the design and development for a new music-dicovery/radio feature in MediaGo.", 
                "Designed promotional graphics and videos for MediaGo", 
                "Proposed a UI re-design of the entire MediaGo application, enhancing aesthetics, and ove user experience", 
                "Developed the front-end for the new feature using HTML, SASS and jQuery"
            ], 
            "term": "Fall 2013", 
            "url": "mediago.sony.com"
        }
    ], 
    "objective": "I’m a \"big-picture\" problem solver; always looking for the best solution to the right problem. I’m someone who will rise to a challenge and will get the job done. My engineering education, and skills in user-centred design, human-factors, and front-end development allow me to approach complex problems from a unique perspective, specifically when designing and researching at Noom, KnowRoaming, and Sony.", 
    "projects": [
        {
            "description": "A variable hearing protection device for periodically loud environments which continuously adjusts its attenuation based on the loudness of the environment.", 
            "id": "fydp", 
            "name": "Chameleon Hearing", 
            "responsibilities": [
                "Managed team priorities and coordinated development efforts.", 
                "Researched user needs and requirements to inform design.", 
                "Developed device testing validation procedures and software", 
                "Developed analog circuit to determine the perceived loudness at the ear"
            ], 
            "term": "Sept. 2016 - May 2017", 
            "url": "http://adamthompson.ca/Portfolio/?p=chameleon"
        }, 
        {
            "description": "An interactive fountain with dynamic water spouts controlled by an Arduino, connected via a Raspberry Pi to enable users to play a quiz game with the fountain, which reacted to the quiz responses", 
            "id": "smrt-watr", 
            "name": "SMRT WATR", 
            "responsibilities": [
                "Designed in-game interface, and information architecture", 
                "Developed the web-app front-end, and a portion of the Python server."
            ], 
            "term": "Spring 2015", 
            "url": "http://adamthompson.ca/Portfolio/?p=smrtwatr"
        }, 
        {
            "description": "A simple iOS metronome app with a minimal interface built during Hack The North 2016.", 
            "id": "metronome", 
            "name": "TAP Metronome", 
            "term": "Fall 2016", 
            "url": "http://adamthompson.ca/Portfolio/?p=tap-metronome"
        }, 
        {
            "description": "A web app that represents the current temperature, weather conditions and time as an HSV colour.", 
            "id": "color-therm", 
            "name": "Colour Thermometer", 
            "term": "Winter 2015", 
            "url": "http://www.adamthompson.ca/ColourThermometer/"
        }
    ], 
    "showCourses": false, 
    "skills": [
        "Sketch", 
        "Balsamiq", 
        "Framer", 
        "Photoshop", 
        "Illustrator", 
        "After Effects", 
        "InVision", 
        "HTML", 
        "jQuery", 
        "Python"
    ], 
    "summary": [
        "Experience in UX and Product design since 2013.", 
        "Researching, developing and prioritizing user & technological requirements.", 
        "Developing and presenting design ideas backed by research, and following through with an implementation plan.", 
        "Collaborating solutions with designers, developers, and other stakeholders."
    ], 
    "tagline": "B.ASc. Systems Design Engineering - University of Waterloo"
}