{
    "clubs": [
        {
            "description": "Vice President of the UW campus UX Club.", 
            "id": "uwux", 
            "name": "UW/UX", 
            "term": "Fall 2014 to Spring 2016"
        }, 
        {
            "description": "Soloist and lead baritone for the international finalist A Cappella group.", 
            "id": "waterboys", 
            "name": "The Water Boys", 
            "term": "Fall 2013 to Winter 2017"
        }
    ], 
    "courseDescriptions": false, 
    "education": [
        {
            "degree": "BASc.", 
            "id": "uwaterloo", 
            "minor": "Cognitive Science", 
            "program": "Systems Design Engineering", 
            "school": "University of Waterloo", 
            "url": "uwaterloo.ca/systems-design-engineering/about-systems-design-engineering"
        }
    ], 
    "experience": [
        {
            "company": "Zynga", 
            "location": "Toronto, ON", 
            "position": "Product Manager (Poker)", 
            "responsibilities": [
                "Designed initial UX wireframes and feature specifications for a new feature expected to increase Daily Active Users up to 10%.", 
                "Performed background research, user analysis, and A/B testing as part of the design process for a new subscription model.", 
                "Configured final tuning parameters and UX flow for a viral engagement feature which increased Facebook-feed app entry by 36%."
            ], 
            "term": "Spring 2016", 
            "url": "zynga.com/poker"
        }, 
        {
            "company": "Noom", 
            "location": "New York City, NY", 
            "position": "Product Designer", 
            "responsibilities": [
                "Leveraging user testing data, re-designed the meal-logging experience to better reflect the observed mental model of logging food, which improved clarity and speed of navigation.", 
                "Enhanced the food portion picker interface to improve user confidence when logging food items.", 
                "Managed the early design process for the coach dashboard involving collaboration with all stakeholders to better understand product requirements."
            ], 
            "term": "Fall 2015", 
            "url": "noom.com"
        }, 
        {
            "company": "KnowRoaming", 
            "location": "Toronto, ON", 
            "position": "UX Designer", 
            "responsibilities": [
                "Redesigned both iOS and Android apps from the ground up. Everything from the registration flow, to the in-app experience for all use cases.", 
                "Designed and prototyped a retail stand for dispensing product boxes and displaying product information in retail stores.", 
                "Created 3D concept models of an automated sticker application device using AutoCAD and Inventor"
            ], 
            "term": "Spring 2014 & Winter 2015", 
            "url": "knowroaming.com"
        }
    ], 
    "objective": "I’m a \"big-picture\" problem solver; always looking for the best solution to the right problem. I’m someone who will rise to a challenge and will get the job done. My engineering education, and skills in user-centred design, human-factors, and front-end development allow me to approach complex problems from a unique perspective, specifically when designing and researching at Noom, KnowRoaming, and Sony.", 
    "projects": [
        {
            "description": "A variable hearing protection device for periodically loud environments which continuously adjusts its attenuation based on the loudness of the environment.", 
            "id": "fydp", 
            "name": "Chameleon", 
            "responsibilities": [
                "Designed ear-cup and variable attenuation mechanism", 
                "Prototyped analog circuit to compute the perceived loudness at the ear", 
                "Designed exposure-prediction and control logic on Teensy", 
                "Developed device testing validation procedures and software"
            ], 
            "term": "Sept. 2016 - present"
        }, 
        {
            "description": "An interactive fountain with dynamic water spouts controlled by an Arduino, connected via a Raspberry Pi to enable users to play a quiz game with the fountain, which reacted to the quiz responses", 
            "id": "smrt-watr", 
            "name": "SMRT WATR", 
            "responsibilities": [
                "Designed in-game interface, and information architecture", 
                "Developed the web-app front-end, and a portion of the Python server.", 
                "Designed a mechanism to allow the servo motor to rotate the fountain jet"
            ], 
            "term": "Spring 2015"
        }, 
        {
            "description": "An analog circuit that uses a series of band-pass filters, and envelope detector, and rectifier to discern whether the high-E string is in tune", 
            "id": "tuner", 
            "name": "Analog Single-Note Guitar Tuner", 
            "term": "August 2015"
        }, 
        {
            "description": "An Arduino system that takes samples from a mono-audio channel and outputs the relative volume on an array of LEDs", 
            "id": "vu-meter", 
            "name": "Arduino VU Meter", 
            "term": "August 2013"
        }
    ], 
    "showCourses": false, 
    "skills": [
        "Fusion", 
        "Rhino", 
        "AutoCAD", 
        "Inventor", 
        "Photoshop", 
        "Illustrator", 
        "Arduino", 
        "MATLAB", 
        "Python", 
        "Makerbot"
    ], 
    "summary": [
        "Experience in UX and Product design since 2013.", 
        "Researching, developing and prioritizing user & technological requirements.", 
        "Developing and presenting design ideas backed by research, and following through with an implementation plan.", 
        "Collaborating solutions with designers, developers, and other stakeholders."
    ], 
    "tagline": "B.ASc. Systems Design Engineering - University of Waterloo"
}