{
    "clubs": [
        {
            "description": "Vice President of the UW campus UX Club. Currently an active member", 
            "id": "uwux", 
            "name": "UW/UX", 
            "term": "Fall 2014 to Spring 2016"
        }, 
        {
            "description": "Lead baritone for the premiere all-male a cappella group at UW", 
            "id": "waterboys", 
            "name": "The Water Boys", 
            "term": "Fall 2013 to Winter 2017"
        }
    ], 
    "courseDescriptions": false, 
    "education": [
        {
            "degree": "BASc.", 
            "id": "uwaterloo", 
            "minor": "Cognitive Science", 
            "program": "Systems Design Engineering", 
            "school": "University of Waterloo", 
            "url": "uwaterloo.ca/systems-design-engineering/about-systems-design-engineering"
        }
    ], 
    "experience": [
        {
            "company": "Zynga", 
            "location": "Toronto, ON", 
            "position": "Product Manager (Poker)", 
            "responsibilities": [
                "Designed the initial UX wireframes and feature specifications for a hand replay feature expected to increase Daily Active Users", 
                "Performed background research, user analysis, and A/B testing as part of the design process for a new Subscriptions model", 
                "Configured final tuning parameters and UX flow for a viral engagement feature which increased Facebok feed app entry by 36%", 
                "Managed, analyzed, and reported on key metrics for various in-app experiments"
            ], 
            "term": "Spring 2016", 
            "url": "zynga.com/poker"
        }, 
        {
            "company": "Noom", 
            "location": "New York City, NY", 
            "position": "Product Designer", 
            "responsibilities": [
                "Leveraged user testing results to re-design the meal-logging experience, improving clarity, speed of navigation and to better reflect the common mental model of logging food", 
                "Prototyped and iterated interaction designs using Sketch, Framer JS, and Origami, and tested using Usability Hub and UserTesting.com", 
                "Enhanced the food portion picker interface to improve user confidence when logging food items", 
                "Initiated multidisciplinary collaboration with all stakeholders to better understand product requirements, and managed the early design process for the coach dashboard"
            ], 
            "term": "Fall 2015", 
            "url": "noom.com"
        }, 
        {
            "company": "KnowRoaming", 
            "location": "Toronto, ON", 
            "position": "UX Designer", 
            "responsibilities": [
                "Redesigned both iOS and Android apps from the ground up. I reworked everything from the registration workflow, to the in app experience at home and abroad using the KnowRoaming SIM Sticker", 
                "Designed and prototyped a retail stand for dispensing product boxes and displaying product information in retail stores.", 
                "Designed and developed the KnowRoaming Athletes sign-up page using HTML5, CSS3, CoffeeScript and PHP", 
                "Storyboarded, and animated an app intro video for the updated KnowRoaming app"
            ], 
            "term": "Spring 2014 & Winter 2015", 
            "url": "knowroaming.com"
        }, 
        {
            "company": "Sony", 
            "location": "Waterloo, ON", 
            "position": "UX Designer", 
            "responsibilities": [
                "Lead the design and development for a new music-dicovery/radio feature in MediaGo.", 
                "Proposed a UI re-design of the entire MediaGo application, enhancing aesthetics, and ove user experience", 
                "Designed promotional graphics and videos for MediaGo", 
                "Developed the front-end for the new feature using HTML, SASS and jQuery"
            ], 
            "term": "Fall 2013", 
            "url": "mediago.sony.com"
        }
    ], 
    "objective": "I’m a \"big-picture\" problem solver; always looking for the best solution to the right problem. I’m someone who will rise to a challenge and will get the job done. My engineering education, and skills in user-centred design, human-factors, and front-end development allow me to approach complex problems from a unique perspective, specifically when designing and researching at Noom, KnowRoaming, and Sony.", 
    "projects": [
        {
            "description": "A variable hearing protection device for periodically loud environments, such as construction sites and factories which continuously adjusts its attenuation based on the loudness of the environment.", 
            "id": "fydp", 
            "name": "Chameleon Hearing Protection", 
            "responsibilities": [
                "Designed outer casing, and attenuator actuation mechanism", 
                "Managed team priorities and coordinated collaboration efforts", 
                "Designed and built testing apparatus and developed test evaluation software", 
                "Developed analog circuit to determine the perceived loudness at the ear"
            ], 
            "term": "Sept. 2016 - present"
        }, 
        {
            "description": "An interactive fountain with dynamic water spouts controlled by an Arduino, connected via a Raspberry Pi to enable users to play a quiz game with the fountain, which reacted to the quiz responses", 
            "id": "smrt-watr", 
            "name": "SMRT WATR", 
            "responsibilities": [
                "Designed the game interface, and app architecture", 
                "Developed the web-app front-end, and a portion of the Python server", 
                "Designed a mechanism to allow the servo motor to rotate the fountain jet", 
                "Designed and built the wood and plastic frame and water basin"
            ], 
            "term": "Spring 2015"
        }, 
        {
            "description": "A simple iOS metronome app with a minimal interface built during Hack The North 2016.", 
            "id": "metronome", 
            "name": "TAP Metronome", 
            "term": "Fall 2016"
        }, 
        {
            "description": "A Chrome extension that scans a webpage for Comic Sans, and replaces it with Helvetica.", 
            "id": "comic-sans", 
            "name": "Say No To Comic Sans", 
            "term": "Spring 2013"
        }, 
        {}, 
        null, 
        null, 
        null
    ], 
    "showCourses": false, 
    "skills": [
        [
            "Framer", 
            [
                "framer", 
                "ux", 
                "ui", 
                "js", 
                "coffeescript", 
                "prototype"
            ]
        ], 
        [
            "Origami", 
            [
                "origami", 
                "ux", 
                "ui", 
                "prototype"
            ]
        ], 
        [
            "Sketch", 
            [
                "sketch", 
                "ui", 
                "ux", 
                "wireframe"
            ]
        ], 
        [
            "Balsamiq", 
            [
                "balsamiq", 
                "ux", 
                "wireframe", 
                "pm"
            ]
        ], 
        [
            "HTML", 
            [
                "html", 
                "web", 
                "front-end", 
                "prototype"
            ]
        ], 
        [
            "Photoshop", 
            [
                "ps", 
                "photoshop", 
                "ui", 
                "graphic"
            ]
        ], 
        [
            "CoffeeScript", 
            [
                "coffeescript", 
                "js", 
                "web", 
                "dev"
            ]
        ], 
        [
            "jQuery", 
            [
                "jQuery", 
                "js", 
                "web", 
                "front-end", 
                "dev"
            ]
        ], 
        [
            "Python", 
            [
                "python", 
                "dev", 
                "front-end", 
                "web", 
                "dsp"
            ]
        ], 
        [
            "PHP", 
            [
                "php", 
                "dev", 
                "web"
            ]
        ]
    ], 
    "summary": [
        "Experience in UX and Product design since 2013", 
        "Product Management experience researching, developing and prioritizing user & tech requirements", 
        "Pitching and presenting my own designs at all-hands meetings, backing them up with user-research data, and following through with a plan for imlementation", 
        "Collaborating and brainstorming design solutions with designers, developers, operations, and marketing"
    ], 
    "tagline": "Systems Design Engineering"
}