{
    "bio": {
        "contact": {
            "email": "adam.m.thompson@icloud.com", 
            "phone": "+1-226-972-2838", 
            "web": "adamthompson.ca"
        }, 
        "name": {
            "first": "Adam", 
            "last": "Thompson", 
            "middle": "Michael"
        }, 
        "tagline": [
            "Product Designer - University of Waterloo", 
            "Systems Design Engineering - University of Waterloo", 
            "Systems Design Engineering", 
            "Systems Design Engineering, BASc", 
            "University of Waterloo", 
            "BASc, University of Waterloo", 
            "UX Designer <br> University of Waterloo"
        ]
    }, 
    "clubs": [
        {
            "description": "Soloist and baritone leader for the internationally ranked all-male a Capella group.", 
            "id": "waterboys", 
            "name": "The Water Boys", 
            "responsibilities": [], 
            "term": "Fall 2013 - Winter 2017", 
            "url": "facebook.com/waterboysuw/"
        }, 
        {
            "description": "Vice President of the UW campus UX Club, helping with mentorship and event planning.", 
            "id": "uwux", 
            "name": "UW/UX", 
            "responsibilities": [], 
            "term": "Fall 2014 - Spring 2016", 
            "url": "facebook.com/uwuxwaterloo/"
        }
    ], 
    "courseDescriptions": false, 
    "education": [
        {
            "degree": "BASc", 
            "id": "uwaterloo", 
            "minor": "Cognitive Science", 
            "program": "Systems Design Engineering", 
            "school": "University of Waterloo", 
            "url": "uwaterloo.ca/systems-design-engineering/about-systems-design-engineering"
        }
    ], 
    "experience": [
        {
            "company": "Zynga Poker", 
            "location": "Toronto", 
            "position": "Product Manager", 
            "responsibilities": [
                "Performed user research, competitor analysis and A/B testing for a new subscription-based revenue model.", 
                "Configured the user flow and final parameters for a feature that increased daily news-feed app entry by 4%.", 
                "Designed initial wireframes and feature specifications for a new engagement feature expected to increase daily active users by 10%.", 
                "Analyzed player demographics by monthly spend to better know the sources of revenue, and which players to target for new features."
            ], 
            "term": "Spring 2016", 
            "url": "zynga.com/poker"
        }, 
        {
            "company": "Noom", 
            "location": "New York", 
            "position": "Product Designer", 
            "responsibilities": [
                "Simplified the food logging experience to better fit with the observed mental model, without compromising functionality.", 
                "Leveraged data from rigorously user tested prototypes to inform further design iterations.", 
                "Initiated collaboration with users and stakeholders, and managed the early design process for a Coach Dashboard re-design.", 
                "Improved user confidence when logging food by simplifying the portion picker interface."
            ], 
            "term": "Fall 2015", 
            "url": "noom.com"
        }, 
        {
            "company": "KnowRoaming", 
            "location": "Toronto", 
            "position": "UX Designer", 
            "responsibilities": [
                "Overhauled design and structure of iOS and Android apps to make it simpler, more informative, and conform to common user behaviour.", 
                "Designed and built a sponsorship sign-up page from scratch using SASS, CoffeeScript and PHP.", 
                "Organized semiweekly design meetings with all stakeholders to present prototypes and discuss design of the mobile apps and websites.", 
                "Initiated and oversaw the preliminary design of the new company homepage, and corporate portal."
            ], 
            "term": "Spring 2014/Winter 2015", 
            "url": "knowroaming.com"
        }, 
        {
            "company": "Sony", 
            "location": "Waterloo", 
            "position": "UI Designer", 
            "responsibilities": [
                "Spearheaded design and development for a new music-discovery/radio feature for MediaGo, built in SASS and jQuery.", 
                "Proposed a UI re-design of MediaGo, improving aesthetics and contextual clarity.", 
                "Designed promotional graphics and videos for MediaGo.", 
                "Developed the front-end for the new feature using HTML, SASS and jQuery."
            ], 
            "term": "Fall 2013", 
            "url": "mediago.sony.com"
        }
    ], 
    "projects": [
        {
            "description": "Smart hearing protection that automatically adjusts its attenuation based on the environment.", 
            "id": "fydp", 
            "name": "Chameleon", 
            "responsibilities": [
                "Researched user needs and current behaviour to inform design, and technical requirements.", 
                "Managed project priorities, and led development of mechanical, software and electronic systems.", 
                "Developed analog circuit to determine the perceived loudness at the ear."
            ], 
            "term": "Sept. 2016 - present", 
            "url": "adamthompson.ca/Portfolio/?p=chameleon"
        }, 
        {
            "description": "An interactive IoT water fountain that reacts to player responses in a web-based quiz game.", 
            "id": "smrt-watr", 
            "name": "SMRT WATR", 
            "responsibilities": [
                "Designed and built the game interface using JavaScript and a Tornado Python server.", 
                "Constructed the fountain frame, basin, and designed a mechanism to rotate the fountain.", 
                "Developed the web-app front-end, and a portion of the Python server."
            ], 
            "term": "Spring 2015", 
            "url": "adamthompson.ca/Portfolio/?p=smrtwatr"
        }, 
        {
            "description": "A web app that represents the current temperature, weather conditions and time as an HSV colour.", 
            "id": "color-therm", 
            "name": "Colour Thermometer", 
            "responsibilities": [], 
            "term": "Winter 2015", 
            "url": "adamthompson.ca/ColourThermometer/"
        }, 
        {
            "description": "A simple iOS metronome app with a minimal interface for distraction-free practice.", 
            "id": "metronome", 
            "name": "TAP Metronome", 
            "responsibilities": [], 
            "term": "Fall 2016", 
            "url": "adamthompson.ca/Portfolio/?p=tap-metronome"
        }
    ], 
    "showCourses": false, 
    "skills": [
        "Sketch", 
        "Photoshop", 
        "Illustrator", 
        "Framer", 
        "Origami", 
        "Balsamiq", 
        "InVision", 
        "AE", 
        "HTML", 
        "JavaScript", 
        "Swift"
    ], 
    "summary": [
        "Experience in mobile/web UX and product design since 2013.", 
        "Development and presentation of well-researched design deliverables, like user flows, personas, wireframes and prototypes.", 
        "Collaboratively identifying and solving problems with designers, developers, PMs and other stakeholders in fast-paced environments.", 
        "Research and prioritization of user requirements, and translation into technical requirements."
    ]
}